# 修复后的 yolov8s-mlkcm-pfom.yaml

nc: 80
depth_multiple: 0.33
width_multiple: 0.50

backbone:
  [[-1, 1, Conv, [64, 3, 2]],      # 0-P1/2
   [-1, 1, MLKCM, [64]],           # 1
   [-1, 1, Conv, [128, 3, 2]],     # 2-P2/4
   [-1, 2, PFOM, [128]],           # 3
   [-1, 1, Conv, [256, 3, 2]],     # 4-P3/8
   [-1, 3, PFOM, [256]],           # 5
   [-1, 1, Conv, [512, 3, 2]],     # 6-P4/16
   [-1, 1, MLKCM, [512]]]          # 7

head:
  [[-1, 1, Conv, [256, 1, 1]],     # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 9 (P4->P3)
   [[-1, 5], 1, Concat, [1]],      # 10 拼接 P3
   [-1, 1, PFOM, [256]],           # 11

   [-1, 1, Conv, [128, 1, 1]],     # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13 (P3->P2)
   [[-1, 3], 1, Concat, [1]],      # 14 拼接 P2
   [-1, 1, PFOM, [128]],           # 15

   [-1, 1, Conv, [128, 3, 2]],     # 16 (P2->P3)
   [[-1, 11], 1, Concat, [1]],     # 17 拼接 P3
   [-1, 1, PFOM, [256]],           # 18

   [-1, 1, Conv, [256, 3, 2]],     # 19 (P3->P4)
   [[-1, 8], 1, Concat, [1]],      # 20 拼接 P4
   [-1, 1, MLKCM, [512]],          # 21

   [[11, 15, 21], 1, Detect, [nc]]]  # Detect
